Revit API Introduction Labs
Lab4_3_3_ImportSharedParamFromExcel Class
 Import updated FireRating param values from Excel.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab4_3_3_ImportSharedParamFromExcel : IExternalCommand
Visual Basic (Declaration)
Public Class Lab4_3_3_ImportSharedParamFromExcel _
	Implements IExternalCommand
Visual C++
public ref class Lab4_3_3_ImportSharedParamFromExcel : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab4_3_3_ImportSharedParamFromExcel
See Also
Lab4_3_3_ImportSharedParamFromExcel Members
Labs Namespace